#1.带头结点的单链表只有头指针list,不改变链表的情况下,设计一个高效算法,查找第k个位上的结点.
# 查找成功输出对应的data值,成功返回1,否则返回0
#要求: 写出基本算法设计思想,具体实现步骤,写出算法的时间复杂度
#list


#2.写一个折半查找函数binsearch()
#折半查找的首部:
# binsearch(list R,low,high,k),尽量使得时间复杂度最小
#要求:写出算法基本设计思想,具体实现步骤

#binsearch

#3.设有两个栈s1,s2,都采用顺序栈方式,并且共享一个存储空间[0,...,maxsize-1]
# 为了尽量使用空间,减少溢出的可能,可采用 栈顶相向,迎面增长的存储方式,请设计s1,s2栈的出栈,进栈操作算法.
#要求:利用空间策略,算法数据结构,写出算法步骤
#stack

#4,假设有n个作业,m台机器设备,每个作业i可选择一台设备加工,加工时间为Ti,每次一台设备只加工一个作业
#基于贪心策略写程序,实现作业调度,使n个作业等待时间和最小
#要求:写出贪心算法作业调度策略,描述作业调度算法,写出具体代码
#greedy

